def solution(letter):
        
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    } # 모스부호와 알파벳을 매핑한 딕셔너리

    morse_list = letter.split() # 모스부호 리스트 생성
    
    answer = '' # 각 모스부호를 영어로 바꾸고, 전부 이어 붙이기
    for code in morse_list:
        answer += morse[code]
        
    return answer